In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../data/tab_cooxupe.csv')

In [5]:
df.describe()

              valor
count  5.160000e+02
mean   7.215016e+04
std    3.688211e+05
min    0.000000e+00
25%    2.092925e+02
50%    4.283950e+02
75%    3.002007e+03
max    4.056066e+06

In [6]:
df.sample(5)

        data      valor
478  1984_11  219316.00
42    2020_7     531.82
315   1997_4     212.58
132   2012_1     473.80
203  2007_12     255.43

In [7]:
df.head(5)

     data    valor
0  2023_1  1030.14
1  2023_2  1130.26
2  2023_3  1103.37
3  2023_4  1115.24
4  2023_5  1030.64

1 =  verão - 21 de dezembro a 21 de março 
2 = outono - 21 de março a 21 de junho
3 = inverno - 21 de junho a 23 de setembro
4 = primavera - 23 de setembro a 21 de dezembro

In [8]:
df = pd.read_csv('../data/cafe_final.csv')

In [10]:
df.head(5)

     data    valor  estacao_ano  valor_semestre  valor_bimestre
0  2023_1  1030.14            1         5409.65         2160.40
1  2023_2  1130.26            1            0.00         2218.61
2  2023_3  1103.37            1         7995.56         1030.64
3  2023_4  1115.24            2         6236.15            0.00
4  2023_5  1030.64            2         4410.22            0.00

In [11]:
df.tail(5)

        data     valor  estacao_ano  valor_semestre  valor_bimestre
511   1981_8   7455.29            3             NaN             NaN
512   1981_9   7601.47            3             NaN             NaN
513  1981_10   7814.22            4             NaN             NaN
514  1981_11   8670.28            4             NaN             NaN
515  1981_12  10055.01            4             NaN             NaN

In [12]:
len(df)

516